{
  "G0": "Hızlı Hareket: Kesme yapmadan, boşta hızlı pozisyonlama. Genellikle bir sonraki kesme pozisyonuna en hızlı şekilde gitmek için kullanılır. **Örnek: `G0 X50 Y25` (X50, Y25 koordinatlarına en hızlı şekilde git)**",
  "G1": "Doğrusal Hareket: Belirtilen hızda (F komutu ile belirlenir) düz bir çizgi boyunca hareket. Kesme işlemleri için kullanılır. **Örnek: `G1 X100 Y100 F100` (X100, Y100 koordinatlarına 100 birim/dakika hızla git)**",
  "G2": "Saat Yönünde Dairesel Hareket: Belirtilen hızda (F komutu ile belirlenir) saat yönünde dairesel yay çizme. I ve J parametreleri ile merkez noktası belirtilir. **Örnek: `G2 X50 Y50 I10 J0 F50` (X50, Y50'ye saat yönünde, merkez noktası mevcut konumdan X'te 10 birim uzaklıkta olan bir yay çizerek git, 50 birim/dakika hızla)**",
  "G3": "Saat Yönünün Tersine Dairesel Hareket: Belirtilen hızda (F komutu ile belirlenir) saat yönünün tersine dairesel yay çizme. I ve J parametreleri ile merkez noktası belirtilir. **Örnek: `G3 X50 Y50 I10 J0 F50` (X50, Y50'ye saat yönünün tersine, merkez noktası mevcut konumdan X'te 10 birim uzaklıkta olan bir yay çizerek git, 50 birim/dakika hızla)**",
  "G17": "XY Düzlemi Seçimi: Dairesel interpolasyon ve diğer işlemlerde XY düzlemini aktif hale getirir. Genellikle varsayılan düzlemdir. **Örnek: `G17` (XY düzlemini aktif hale getir)**",
  "G18": "XZ Düzlemi Seçimi: Dairesel interpolasyon ve diğer işlemlerde XZ düzlemini aktif hale getirir. **Örnek: `G18` (XZ düzlemini aktif hale getir)**",
  "G19": "YZ Düzlemi Seçimi: Dairesel interpolasyon ve diğer işlemlerde YZ düzlemini aktif hale getirir. **Örnek: `G19` (YZ düzlemini aktif hale getir)**",
  "G20": "İnch Birim Sistemi: Uzunluk birimini inç olarak ayarlar. **Örnek: `G20` (Birimleri inç olarak ayarla)**",
  "G21": "Metrik Birim Sistemi: Uzunluk birimini milimetre olarak ayarlar. **Örnek: `G21` (Birimleri milimetre olarak ayarla)**",
  "G28": "Referans Noktasına Dönüş: Makinenin referans (home) noktasına otomatik olarak dönmesini sağlar. Genellikle program başlangıcında veya sonunda kullanılır. **Örnek: `G28 X0 Y0 Z0` (X, Y, Z eksenlerini referans noktasına gönder)**",
  "G90": "Mutlak Koordinat Sistemi: Koordinatları, makinenin sıfır noktasına göre mutlak değerler olarak yorumlar. **Örnek: `G90` (Mutlak koordinat sistemini aktif et)**",
  "G91": "Artımlı Koordinat Sistemi: Koordinatları, mevcut pozisyona göre göreceli (artımlı) değerler olarak yorumlar. **Örnek: `G91` (Artımlı koordinat sistemini aktif et)**",
  "G54": "İş Parçası Koordinat Sistemi 1: İş parçası için tanımlanmış koordinat sistemini (sıfır noktasını) aktif hale getirir. Birden fazla iş parçası koordinat sistemi (G55, G56, vb.) tanımlanabilir. **Örnek: `G54` (1. İş parçası koordinat sistemini aktif et)**",
  "M03": "İş Mili Saat Yönünde Döndürme: İş milini belirtilen hızda (S komutu ile belirlenir) saat yönünde döndürmeye başlar. **Örnek: `M3 S1000` (İş milini saat yönünde 1000 RPM hızda döndürmeye başla)**",
  "M4": "İş Mili Saat Yönünün Tersine Döndürme: İş milini belirtilen hızda (S komutu ile belirlenir) saat yönünün tersine döndürmeye başlar. **Örnek: `M4 S1000` (İş milini saat yönünün tersine 1000 RPM hızda döndürmeye başla)**",
  "M5": "İş Mili Durdurma: İş milinin dönmesini durdurur. **Örnek: `M5` (İş milini durdur)**",
  "M04": "İş Mili Saat Yönünün Tersine Döndürme: İş milini belirtilen hızda (S komutu ile belirlenir) saat yönünün tersine döndürmeye başlar. **Örnek: `M4 S1000` (İş milini saat yönünün tersine 1000 RPM hızda döndürmeye başla)**",
  "M05": "İş Mili Durdurma: İş milinin dönmesini durdurur. **Örnek: `M5` (İş milini durdur)**",
  "M30": "Program Sonu: Programın sonunu işaret eder ve genellikle makineyi başlangıç durumuna döndürür. **Örnek: `M30` (Program sonu)**"
}
